{"location_type": "open", "id": "100042", "event_s": "You come across a river crossing while you're wandering through the {region[local][name]}.\n\nThe river is unusually turbulent, and the bridge is rotting and has partially collapsed.", "action_s": ["Find another crossing", "Use the bridge", "Swim across"], "result_s": [["It wouldn't be a smart idea to use a decayed bridge to cross such raging waters.\n\nYou decide to keep walking upstream in the hopes that there will be another bridge. After a couple of minutes, you come across one that appears more structurally sound.\n\nYou successfully cross over and continue on your way."], ["You tenuously make your way across the first part of the bridge; you ensure not to step on any members that won't hold your weight, prodding questionable crossbeams with your foot.\n\nWithout warning, you hear a resounding 'CRACK', as the beam you placed your weight on gives way, and you fall into the raging river below.\n\nAs you lose consciousness, you curse the architect who designed that shoddy excuse for a walkway.", "You tenuously make your way across the first part of the bridge; you ensure not to step on any members that won't hold your weight, prodding questionable crossbeams with your foot.\n\nLuckily, you manage to pick the right pieces to place your weight on, and reach the other side unharmed.\n\nNo bridge, no matter how poorly designed, will get in your way."], ["You decide to take the most dangerous route possible when trying to cross a river that is flowing at full force: swim through it.\n\nAs you wade into the water, the sheer strength of the water almost knocks you over even at waist height. You remove all doubt from your mind and dive in, promptly losing your foothold and getting carried away.\n\nYour lungs start filling with water and you lose consciousness, trapped in the current."]], "result_prob": [[1], [0.8, 0.2], [1]], "conseq": [[[]], [["change_event_id('100043')", "change_health(-20)"], []], [["change_event_id('100043')", "change_health(-20)"]]], "requirements": [[], [], []], "gen": {"characters": 0, "opens": 0, "towns": 0, "dungeons": 0, "items": 0}, "spec": [], "strings": {"open": ["{region[local][name]}"]}}